# GetHookPermission Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBarType..::..GetHookPermission Method
RebarBarType Class See Also
---
Identifies if a hook type is permitted for this bar type
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool GetHookPermission(
	ElementId hookId
)
```

Visual Basic
---
```text
Public Function GetHookPermission ( _
	hookId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool GetHookPermission(
	ElementId^ hookId
)
```

# ### Parameters
hookId
    Type: Autodesk.Revit.DB..::..ElementId id of the hook type
# ### Return Value
True if the hook type is permitted for this bar type, otherwise false
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | the rebar hook type id hookId is not valid |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace